tap "aws/tap"
tap "hashicorp/tap"
#tap "homebrew/core"
#tap "homebrew/services"
#tap "instantclienttap/instantclient"
#tap "r-lib/rig"
#tap "tophat/bar"
#brew "aom"
brew "automake"
brew "awscli"
brew "awscli-local"
brew "bash"
brew "bash-completion@2"
brew "bat"
#brew "berkeley-db"
#brew "bzip2"
#brew "bison"
#brew "buildkit"
#brew "cairo"
brew "checkbashisms"
#brew "chruby"
brew "cmake"
brew "colima"
brew "coreutils"
#brew "crane"
#brew "cryptography"
brew "ctop"
brew "curl"
brew "deno"
brew "dive"
#brew "docker"
#brew "docker-buildx"
#brew "docker-compose"
#brew "docker-credential-helper"
#brew "docutils"
#brew "elvish"
#brew "eza"
brew "fd"
brew "ffmpeg"
brew "flock", link: false
brew "fnm"
#brew "freetype"
brew "fzf"
brew "gcc"
#brew "gd"
brew "gdb"
brew "gdbm"
#brew "gdk-pixbuf"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gitlab-runner"
#brew "gettext"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
#brew "go"
brew "goenv"
brew "gradle-completion"
#brew "graphviz"
brew "grep"
#brew "grpc"
brew "grpcurl"
#brew "gts"
brew "haproxy"
#brew "harfbuzz"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/vault"
brew "helm"
brew "htop"
brew "instantclienttap/instantclient/instantclient-sqlplus"
#brew "jd"
brew "jenv"
#brew "jpeg-xl"
brew "jq"
brew "krb5"
brew "libpq", link: true
#brew "lxc"
#brew "kamel"
brew "kubernetes-cli"
brew "lazygit"
#brew "leptonica"
#brew "lighttpd"
#brew "lima"
#brew "little-cms2"
brew "localstack"
brew "lua"
brew "make"
brew "marksman"
brew "miller"
#brew "minikube"
brew "mysql-client"
#brew "ncdu"
brew "neovim"
#brew "netpbm"
#brew "nghttp2"
#brew "openldap"
#brew "openjdk@17"
#brew "openjpeg"
#brew "openssl@1.1"
#brew "pango"
#brew "openssl@3"
#brew "p11-kit"
#brew "parquet-cli"
#brew "parquet-tools"
#brew "pass"
brew "perl"
brew "php"
brew "pipenv"
#brew "protobuf"
brew "pstree"
brew "pyenv"
brew "python-yq"
#brew "python@3.10"
#brew "python@3.11"
#brew "python@3.9"
#brew "qemu"
#brew "rbenv"
#brew "redis"
brew "ripgrep"
#brew "rlwrap"
#brew "rtmpdump"
brew "rustup-init"
#brew "ruby-build"
#brew "ruby-install"
brew "shellcheck"
brew "sqlcmd"
brew "sqlite"
#brew "srt"
brew "stow"
#brew "tcl-tk"
brew "telnet"
#brew "tesseract"
brew "tfenv"
brew "tidy-html5"
brew "tig"
brew "tmux"
#brew "tophat/bar/yvm"
#brew "trash-cli"
brew "tree"
#brew "unbound"
brew "watch"
#brew "webp"
brew "wget"
brew "whalebrew"
#brew "xz"
#brew "zig"
brew "zoxide"
whalebrew "whalebrew/whalesay"

# Casks
#cask "bloomrpc"
#cask "gimp"
#cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kitty"
#cask "obsidian"
#cask "squidman"
#cask "swiftdefaultappsprefpane"
cask "visual-studio-code"
cask "xquartz"

# VSCode extensions
vscode "adpyke.vscode-sql-formatter"
vscode "bierner.markdown-emoji"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naco-siren.gradle-language"
vscode "orta.vscode-jest"
vscode "orta.vscode-twoslash-queries"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "vue.vscode-typescript-vue-plugin"
vscode "vuetifyjs.vuetify-vscode"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
