tap "aws/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "instantclienttap/instantclient"
tap "tophat/bar"
brew "apr"
brew "arduino-cli"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bzip2"
brew "checkbashisms"
brew "cmake"
brew "ctop"
brew "dash"
brew "deno"
brew "dive"
brew "docker-credential-helper", link: false
brew "elvish"
brew "fnm"
brew "gcc"
brew "gdb"
brew "gdbm"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gitlab-runner"
brew "gnupg"
brew "haproxy"
brew "helm"
brew "htop"
brew "jabba"
brew "jenv"
brew "jq"
brew "krb5"
brew "libidn2"
brew "libxml2"
brew "lxc"
brew "make"
brew "miller"
brew "minikube"
brew "nasm"
brew "pipenv"
brew "protobuf"
brew "pstree"
brew "pyenv"
brew "python-yq"
brew "rl-wrap"
brew "rpm"
brew "shellcheck"
brew "telnet"
brew "tidy-html5"
brew "tfenv"
brew "tmux"
brew "trash-cli"
brew "travis"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/vault"
brew "heroku/brew/heroku"
brew "instantclienttap/instantclient/instantclient-sqlplus"
brew "tophat/bar/yvm"
cask "docker"
cask "gimp"
cask "graphql-playground"
cask "iterm2"
cask "jetbrains-toolbox"
cask "minikube"
cask "obsidian"
cask "postman"
cask "racket"
cask "textmate"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"
