tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "apr"
brew "arduino-cli"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "checkbashisms"
brew "cmake"
brew "dash"
brew "deno"
brew "gcc"
brew "gdb"
brew "git"
brew "haproxy"
brew "helm"
brew "jabba"
brew "jenv"
brew "jq"
brew "krb5"
brew "libidn2"
brew "libxml2"
brew "make"
brew "minikube"
brew "nasm"
brew "nvm"
brew "pipenv"
brew "postgresql"
brew "protobuf"
brew "pyenv"
brew "rpm"
brew "terraform"
brew "tmux"
brew "travis"
brew "watch"
brew "wget"
brew "yq"
brew "heroku/brew/heroku"
cask "docker"
cask "graphql-playground"
cask "jetbrains-toolbox"
cask "minikube"
cask "racket"
cask "textmate"
cask "virtualbox"
cask "xquartz"
